% Calculate matrix of centrifugal and coriolis load on the joints for
% S5PPRRR2
% Use Code from Maple symbolic Code Generation
% 
% Input:
% qJ [5x1]
%   Generalized joint coordinates (joint angles)
% qJD [5x1]
%   Generalized joint velocities
% pkin [9x1]
%   kinematic parameters (e.g. lengths of the links)
%   pkin=[a2,a3,a4,a5,d3,d4,d5,theta1,theta2]';
% m_mdh [6x1]
%   mass of all robot links (including the base)
% rSges [6x3]
%   center of mass of all robot links (in body frames)
%   rows: links of the robot (starting with base)
%   columns: x-, y-, z-coordinates
% Icges [6x6]
%   inertia of all robot links about their respective center of mass, in body frames
%   rows: links of the robot (starting with base)
%   columns: xx, yy, zz, xy, xz, yz (see inertiavector2matrix.m)
% 
% Output:
% Cq [5x5]
%   matrix of coriolis and centrifugal joint torques.
%   Gives coriolis joint torques when multiplied with joint velocities

% Quelle: HybrDyn-Toolbox
% Datum: 2019-12-05 15:15
% Revision: 77da58f92bca3eff71542919beafa37024070d86 (2019-12-05)
% Moritz Schappler, moritz.schappler@imes.uni-hannover.de
% (C) Institut für Mechatronische Systeme, Universität Hannover

function Cq = S5PPRRR2_coriolismatJ_fixb_slag_vp1(qJ, qJD, ...
  pkin, m, rSges, Icges)
%% Coder Information
%#codegen
%$cgargs {zeros(5,1),zeros(5,1),zeros(9,1),zeros(6,1),zeros(6,3),zeros(6,6)}
assert(isreal(qJ) && all(size(qJ) == [5 1]), ...
  'S5PPRRR2_coriolismatJ_fixb_slag_vp1: qJ has to be [5x1] (double)');
assert(isreal(qJD) && all(size(qJD) == [5 1]), ...
  'S5PPRRR2_coriolismatJ_fixb_slag_vp1: qJD has to be [5x1] (double)');
assert(isreal(pkin) && all(size(pkin) == [9 1]), ...
  'S5PPRRR2_coriolismatJ_fixb_slag_vp1: pkin has to be [9x1] (double)');
assert(isreal(m) && all(size(m) == [6 1]), ...
  'S5PPRRR2_coriolismatJ_fixb_slag_vp1: m has to be [6x1] (double)'); 
assert(isreal(rSges) && all(size(rSges) == [6,3]), ...
  'S5PPRRR2_coriolismatJ_fixb_slag_vp1: rSges has to be [6x3] (double)');
assert(isreal(Icges) && all(size(Icges) == [6 6]), ...
  'S5PPRRR2_coriolismatJ_fixb_slag_vp1: Icges has to be [6x6] (double)'); 

%% Symbolic Calculation
% From coriolismat_joint_fixb_par1_matlab.m
% OptimizationMode: 2
% StartTime: 2019-12-05 15:14:12
% EndTime: 2019-12-05 15:14:30
% DurationCPUTime: 11.99s
% Computational Cost: add. (52464->608), mult. (51266->924), div. (0->0), fcn. (55985->8), ass. (0->364)
t332 = cos(pkin(8));
t503 = t332 ^ 2;
t331 = sin(pkin(8));
t504 = t331 ^ 2;
t511 = t503 + t504;
t329 = pkin(9) + qJ(3);
t325 = sin(t329);
t326 = cos(t329);
t518 = Icges(4,5) * t325 + Icges(4,6) * t326;
t334 = cos(qJ(4));
t483 = pkin(4) * t334;
t262 = -pkin(7) * t326 + t483 * t325;
t230 = t262 * t331;
t330 = qJ(4) + qJ(5);
t327 = sin(t330);
t328 = cos(t330);
t383 = rSges(6,1) * t328 - rSges(6,2) * t327;
t271 = -rSges(6,3) * t326 + t325 * t383;
t250 = t271 * t332;
t333 = sin(qJ(4));
t384 = rSges(5,1) * t334 - rSges(5,2) * t333;
t279 = -rSges(5,3) * t326 + t325 * t384;
t260 = t279 * t331;
t261 = t279 * t332;
t489 = t325 / 0.2e1;
t488 = -t326 / 0.2e1;
t487 = t331 / 0.2e1;
t486 = -t332 / 0.2e1;
t434 = t328 * t332;
t436 = t327 * t331;
t295 = -t326 * t436 - t434;
t431 = t332 * t327;
t435 = t328 * t331;
t296 = t326 * t435 - t431;
t440 = t325 * t331;
t200 = rSges(6,1) * t296 + rSges(6,2) * t295 + rSges(6,3) * t440;
t439 = t325 * t332;
t190 = t200 * t439;
t430 = t332 * t333;
t263 = pkin(7) * t325 + t483 * t326;
t446 = t263 * t331;
t204 = -pkin(4) * t430 + t446;
t297 = -t326 * t431 + t435;
t298 = t326 * t434 + t436;
t201 = rSges(6,1) * t298 + rSges(6,2) * t297 + rSges(6,3) * t439;
t433 = t331 * t333;
t399 = pkin(4) * t433;
t205 = t263 * t332 + t399;
t421 = t201 + t205;
t124 = t190 + (t204 * t332 - t331 * t421) * t325;
t173 = t326 * t200 + t271 * t440;
t449 = t204 * t326;
t135 = t262 * t440 + t173 + t449;
t414 = -t262 - t271;
t388 = t414 * t332;
t389 = t421 * t326;
t136 = t325 * t388 - t389;
t222 = rSges(6,1) * t295 - rSges(6,2) * t296;
t202 = t222 * t439;
t223 = rSges(6,1) * t297 - rSges(6,2) * t298;
t170 = -t223 * t440 + t202;
t294 = (-rSges(6,1) * t327 - rSges(6,2) * t328) * t325;
t186 = t326 * t222 + t294 * t440;
t187 = -t223 * t326 - t294 * t439;
t216 = Icges(6,5) * t295 - Icges(6,6) * t296;
t285 = Icges(6,4) * t295;
t198 = Icges(6,1) * t296 + Icges(6,5) * t440 + t285;
t424 = -Icges(6,2) * t296 + t198 + t285;
t466 = Icges(6,4) * t296;
t196 = Icges(6,2) * t295 + Icges(6,6) * t440 + t466;
t426 = Icges(6,1) * t295 - t196 - t466;
t111 = -t216 * t326 + (-t327 * t424 + t328 * t426) * t325;
t217 = Icges(6,5) * t297 - Icges(6,6) * t298;
t286 = Icges(6,4) * t297;
t199 = Icges(6,1) * t298 + Icges(6,5) * t439 + t286;
t423 = -Icges(6,2) * t298 + t199 + t286;
t465 = Icges(6,4) * t298;
t197 = Icges(6,2) * t297 + Icges(6,6) * t439 + t465;
t425 = Icges(6,1) * t297 - t197 - t465;
t112 = -t217 * t326 + (-t327 * t423 + t328 * t425) * t325;
t287 = (-Icges(6,5) * t327 - Icges(6,6) * t328) * t325;
t464 = Icges(6,4) * t327;
t378 = Icges(6,1) * t328 - t464;
t269 = -Icges(6,5) * t326 + t325 * t378;
t411 = t269 + (-Icges(6,2) * t328 - t464) * t325;
t463 = Icges(6,4) * t328;
t374 = -Icges(6,2) * t327 + t463;
t267 = -Icges(6,6) * t326 + t325 * t374;
t412 = -t267 + (-Icges(6,1) * t327 - t463) * t325;
t443 = t287 * t326;
t98 = t216 * t440 + t295 * t424 + t296 * t426;
t99 = t217 * t440 + t295 * t423 + t296 * t425;
t38 = -(t295 * t411 + t296 * t412) * t326 + (t99 * t332 + (t98 - t443) * t331) * t325;
t100 = t216 * t439 + t297 * t424 + t298 * t426;
t101 = t217 * t439 + t297 * t423 + t298 * t425;
t39 = -(t297 * t411 + t298 * t412) * t326 + (t100 * t331 + (t101 - t443) * t332) * t325;
t392 = t439 / 0.2e1;
t393 = t440 / 0.2e1;
t505 = t326 ^ 2;
t400 = t38 * t393 + t39 * t392 + (t505 * t287 + (t112 * t332 + t111 * t331 - (-t411 * t327 + t412 * t328) * t326) * t325) * t488;
t7 = t400 + m(6) * (t124 * t170 + t135 * t186 + t136 * t187);
t512 = t7 * qJD(5);
t442 = (-Icges(5,5) * t333 - Icges(5,6) * t334) * t325 * t326;
t467 = Icges(5,4) * t334;
t375 = -Icges(5,2) * t333 + t467;
t275 = -Icges(5,6) * t326 + t325 * t375;
t410 = -t275 + (-Icges(5,1) * t333 - t467) * t325;
t468 = Icges(5,4) * t333;
t379 = Icges(5,1) * t334 - t468;
t277 = -Icges(5,5) * t326 + t325 * t379;
t409 = t277 + (-Icges(5,2) * t334 - t468) * t325;
t320 = t326 * pkin(3) + t325 * pkin(6);
t403 = t511 * t320;
t422 = t200 + t204;
t121 = t331 * t422 + t332 * t421 + t403;
t429 = t332 * t334;
t313 = -t326 * t433 - t429;
t432 = t331 * t334;
t314 = t326 * t432 - t430;
t214 = rSges(5,1) * t314 + rSges(5,2) * t313 + rSges(5,3) * t440;
t315 = -t326 * t430 + t432;
t316 = t326 * t429 + t433;
t215 = rSges(5,1) * t316 + rSges(5,2) * t315 + rSges(5,3) * t439;
t157 = t214 * t331 + t215 * t332 + t403;
t172 = t331 * t222 + t332 * t223;
t307 = t313 * pkin(4);
t308 = t315 * pkin(4);
t158 = t307 * t331 + t308 * t332 + t172;
t239 = rSges(5,1) * t313 - rSges(5,2) * t314;
t240 = rSges(5,1) * t315 - rSges(5,2) * t316;
t181 = t239 * t331 + t240 * t332;
t319 = t325 * pkin(3) - t326 * pkin(6);
t395 = -t319 + t414;
t182 = t395 * t331;
t184 = t395 * t332;
t408 = -t279 - t319;
t225 = t408 * t331;
t227 = t408 * t332;
t484 = pkin(4) * t333;
t385 = t325 * t484 - t294;
t241 = t385 * t331;
t242 = t385 * t332;
t312 = (-rSges(5,1) * t333 - rSges(5,2) * t334) * t325;
t233 = Icges(5,5) * t313 - Icges(5,6) * t314;
t305 = Icges(5,4) * t313;
t212 = Icges(5,1) * t314 + Icges(5,5) * t440 + t305;
t418 = -Icges(5,2) * t314 + t212 + t305;
t470 = Icges(5,4) * t314;
t210 = Icges(5,2) * t313 + Icges(5,6) * t440 + t470;
t420 = Icges(5,1) * t313 - t210 - t470;
t113 = t233 * t440 + t313 * t418 + t314 * t420;
t234 = Icges(5,5) * t315 - Icges(5,6) * t316;
t306 = Icges(5,4) * t315;
t213 = Icges(5,1) * t316 + Icges(5,5) * t439 + t306;
t417 = -Icges(5,2) * t316 + t213 + t306;
t469 = Icges(5,4) * t316;
t211 = Icges(5,2) * t315 + Icges(5,6) * t439 + t469;
t419 = Icges(5,1) * t315 - t211 - t469;
t114 = t234 * t440 + t313 * t417 + t314 * t419;
t73 = -t113 * t332 + t114 * t331;
t115 = t233 * t439 + t315 * t418 + t316 * t420;
t116 = t234 * t439 + t315 * t417 + t316 * t419;
t74 = -t115 * t332 + t116 * t331;
t510 = t73 * t486 + t74 * t487 + m(6) * (t121 * t158 + t182 * t241 + t184 * t242) + m(5) * (t157 * t181 + (-t225 * t331 - t227 * t332) * t312);
t59 = t331 * t99 - t332 * t98;
t60 = -t100 * t332 + t101 * t331;
t481 = t59 * t486 + t60 * t487;
t194 = Icges(6,5) * t296 + Icges(6,6) * t295 + Icges(6,3) * t440;
t245 = t267 * t331;
t247 = t269 * t331;
t371 = Icges(6,5) * t328 - Icges(6,6) * t327;
t265 = -Icges(6,3) * t326 + t325 * t371;
t367 = -t196 * t327 + t198 * t328;
t358 = -t265 * t331 - t367;
t102 = -t358 * t326 + (t245 * t327 - t247 * t328 + t194) * t325;
t195 = Icges(6,5) * t298 + Icges(6,6) * t297 + Icges(6,3) * t439;
t246 = t267 * t332;
t248 = t269 * t332;
t366 = -t197 * t327 + t199 * t328;
t357 = -t265 * t332 - t366;
t103 = -t357 * t326 + (t246 * t327 - t248 * t328 + t195) * t325;
t362 = -t267 * t327 + t269 * t328;
t445 = t265 * t326;
t169 = t325 * t362 - t445;
t268 = Icges(6,6) * t325 + t326 * t374;
t270 = Icges(6,5) * t325 + t326 * t378;
t353 = (Icges(6,3) * t325 + t326 * t371 - t362) * t326;
t452 = t194 * t326;
t137 = t325 * t367 - t452;
t451 = t195 * t326;
t138 = t325 * t366 - t451;
t369 = t137 * t331 + t138 * t332;
t509 = ((t353 + t369) * t326 + (t103 * t332 + t102 * t331 - (-t268 * t327 + t270 * t328 + t265) * t326 + t169) * t325) * t488 + (-t169 * t326 + t325 * t369) * t489;
t372 = Icges(5,5) * t334 - Icges(5,6) * t333;
t273 = -Icges(5,3) * t326 + t325 * t372;
t507 = t518 * t511;
t502 = 2 * qJD(3);
t501 = 2 * qJD(4);
t500 = 4 * qJD(4);
t499 = m(5) / 0.2e1;
t498 = m(6) / 0.2e1;
t363 = t214 * t332 - t215 * t331;
t134 = t363 * t326 + (-t260 * t332 + t261 * t331) * t325;
t280 = rSges(5,3) * t325 + t326 * t384;
t154 = (t280 * t331 - t214) * t325;
t155 = (-t280 * t332 + t215) * t325;
t168 = t363 * t325;
t179 = t214 * t326 + t279 * t440;
t180 = -t215 * t326 - t279 * t439;
t497 = m(5) * (t134 * t168 + t154 * t179 + t155 * t180);
t249 = t271 * t331;
t437 = t326 * t332;
t427 = t200 * t437 - t249 * t439;
t450 = t201 * t326;
t132 = (t250 * t325 - t450) * t331 + t427;
t272 = rSges(6,3) * t325 + t326 * t383;
t438 = t326 * t331;
t396 = -t326 * t249 + t271 * t438 + t272 * t440;
t146 = -t200 * t325 + t396;
t192 = t325 * t201;
t147 = -t272 * t439 + t192;
t161 = -t201 * t440 + t190;
t174 = -t271 * t439 - t450;
t415 = -t262 * t332 - t250;
t85 = (-t230 * t325 + t449) * t332 + (-t325 * t415 - t389) * t331 + t427;
t95 = (-t422 + t446) * t325 + t396;
t413 = -t263 - t272;
t96 = t192 + (t332 * t413 + t205) * t325 + (t388 - t415) * t326;
t495 = m(6) * (t124 * t132 + t135 * t146 + t136 * t147 + t161 * t85 + t173 * t95 + t174 * t96);
t494 = m(6) * (t124 * t85 + t135 * t95 + t136 * t96);
t397 = t170 * t121 + t187 * t182 + t186 * t184;
t493 = m(6) * (t124 * t172 + (-t135 * t332 - t136 * t331) * t294 + t397);
t492 = m(6) * (t158 * t161 + t173 * t242 + t174 * t241 + t397);
t485 = t332 / 0.2e1;
t480 = m(6) * qJD(4);
t479 = m(6) * qJD(5);
t128 = t195 * t440 + t197 * t295 + t199 * t296;
t456 = t128 * t332;
t129 = t194 * t439 + t196 * t297 + t198 * t298;
t455 = t129 * t331;
t209 = Icges(5,5) * t316 + Icges(5,6) * t315 + Icges(5,3) * t439;
t140 = t209 * t440 + t211 * t313 + t213 * t314;
t454 = t140 * t332;
t208 = Icges(5,5) * t314 + Icges(5,6) * t313 + Icges(5,3) * t440;
t141 = t208 * t439 + t210 * t315 + t212 * t316;
t453 = t141 * t331;
t448 = t208 * t326;
t447 = t209 * t326;
t444 = t273 * t326;
t94 = t146 * t331 - t147 * t332;
t428 = t94 * qJD(2);
t416 = -t223 - t308;
t407 = -t280 - t320;
t404 = t511 * t319;
t402 = qJD(4) * t325;
t105 = 0.2e1 * (t132 / 0.4e1 - t172 / 0.4e1) * m(6);
t401 = t105 * qJD(1);
t398 = t94 * t498;
t394 = -t320 + t413;
t391 = t438 / 0.2e1;
t390 = t437 / 0.2e1;
t317 = rSges(4,1) * t325 + rSges(4,2) * t326;
t127 = t194 * t440 + t196 * t295 + t198 * t296;
t159 = t265 * t440 + t267 * t295 + t269 * t296;
t340 = t325 * t358 + t452;
t90 = -t245 * t295 - t247 * t296 + t331 * t340;
t339 = t325 * t357 + t451;
t91 = -t246 * t295 - t248 * t296 + t331 * t339;
t20 = (t456 - t268 * t295 - t270 * t296 + (t127 - t445) * t331) * t326 + (t91 * t332 + t159 + (t90 - t353) * t331) * t325;
t130 = t195 * t439 + t197 * t297 + t199 * t298;
t160 = t265 * t439 + t267 * t297 + t269 * t298;
t92 = -t245 * t297 - t247 * t298 + t332 * t340;
t93 = -t246 * t297 - t248 * t298 + t332 * t339;
t21 = (t455 - t268 * t297 - t270 * t298 + (t130 - t445) * t332) * t326 + (t92 * t331 + t160 + (t93 - t353) * t332) * t325;
t70 = -t159 * t326 + (t127 * t331 + t456) * t325;
t71 = -t160 * t326 + (t130 * t332 + t455) * t325;
t382 = t20 * t393 + t21 * t392 + t71 * t390 + t70 * t391 + t509;
t336 = -m(5) * (t154 * t331 - t155 * t332) / 0.2e1 - m(6) * (t331 * t95 - t332 * t96) / 0.2e1;
t354 = (-t241 * t332 + t242 * t331) * t498;
t33 = t354 + t336;
t42 = 0.2e1 * (t85 / 0.4e1 - t158 / 0.4e1) * m(6) + 0.2e1 * (t134 / 0.4e1 - t181 / 0.4e1) * m(5);
t370 = t42 * qJD(1) - t33 * qJD(2);
t365 = -t210 * t333 + t212 * t334;
t151 = t325 * t365 - t448;
t364 = -t211 * t333 + t213 * t334;
t152 = t325 * t364 - t447;
t368 = t151 * t331 + t152 * t332;
t361 = -t275 * t333 + t277 * t334;
t359 = t495 / 0.2e1 + t382;
t356 = -t273 * t331 - t365;
t355 = -t273 * t332 - t364;
t352 = (Icges(5,3) * t325 + t326 * t372 - t361) * t326;
t50 = t331 * t91 - t332 * t90;
t51 = t331 * t93 - t332 * t92;
t350 = t20 * t486 + t21 * t487 + t51 * t392 + t50 * t393 + (-t102 * t332 + t103 * t331) * t488 + (-t127 * t332 + t128 * t331) * t391 + (-t129 * t332 + t130 * t331) * t390 + (-t137 * t332 + t138 * t331) * t489 - t481;
t347 = t38 * t486 + t59 * t393 + t39 * t487 + t60 * t392 + (-t111 * t332 + t112 * t331) * t488 - t71 * t437 / 0.2e1 - t21 * t439 / 0.2e1 - t70 * t438 / 0.2e1 - t20 * t440 / 0.2e1 - t509;
t338 = t325 * t356 + t448;
t337 = t325 * t355 + t447;
t324 = t325 ^ 2;
t300 = t518 * t332;
t299 = t518 * t331;
t278 = Icges(5,5) * t325 + t326 * t379;
t276 = Icges(5,6) * t325 + t326 * t375;
t259 = t277 * t332;
t258 = t277 * t331;
t257 = t275 * t332;
t256 = t275 * t331;
t228 = t407 * t332;
t226 = t407 * t331;
t224 = t511 * t317;
t189 = -t240 * t326 - t312 * t439;
t188 = t239 * t326 + t312 * t440;
t185 = t394 * t332;
t183 = t394 * t331;
t176 = (t239 * t332 - t240 * t331) * t325;
t175 = t325 * t361 - t444;
t167 = t170 * t479;
t166 = (-t294 * t325 + t324 * t484) * t332 + t416 * t326;
t165 = t307 * t326 - t324 * t399 + t186;
t164 = -t260 * t331 - t261 * t332 - t404;
t163 = t273 * t439 + t275 * t315 + t277 * t316;
t162 = t273 * t440 + t275 * t313 + t277 * t314;
t153 = t202 + (t307 * t332 + t331 * t416) * t325;
t148 = t186 * t331 - t187 * t332;
t145 = t148 * t479;
t142 = t209 * t439 + t211 * t315 + t213 * t316;
t139 = t208 * t440 + t210 * t313 + t212 * t314;
t131 = t415 * t332 + (-t230 - t249) * t331 - t404;
t123 = -t234 * t326 + (-t333 * t417 + t334 * t419) * t325;
t122 = -t233 * t326 + (-t333 * t418 + t334 * t420) * t325;
t118 = -t355 * t326 + (t257 * t333 - t259 * t334 + t209) * t325;
t117 = -t356 * t326 + (t256 * t333 - t258 * t334 + t208) * t325;
t110 = -t257 * t315 - t259 * t316 + t332 * t337;
t109 = -t256 * t315 - t258 * t316 + t332 * t338;
t108 = -t257 * t313 - t259 * t314 + t331 * t337;
t107 = -t256 * t313 - t258 * t314 + t331 * t338;
t106 = (t132 + t172) * t498;
t89 = qJD(3) * t398;
t83 = -t175 * t326 + t325 * t368;
t79 = -t163 * t326 + (t142 * t332 + t453) * t325;
t78 = -t162 * t326 + (t331 * t139 + t454) * t325;
t75 = t121 * t172 + (-t182 * t331 - t184 * t332) * t294;
t64 = -t109 * t332 + t110 * t331;
t63 = -t107 * t332 + t108 * t331;
t46 = -(t315 * t409 + t316 * t410) * t326 + (t115 * t331 + (t116 - t442) * t332) * t325;
t45 = -(t313 * t409 + t314 * t410) * t326 + (t114 * t332 + (t113 - t442) * t331) * t325;
t43 = (t134 + t181) * t499 + (t158 + t85) * t498;
t41 = t132 * t161 + t146 * t173 + t147 * t174;
t32 = t354 - t336;
t31 = (t352 + t368) * t326 + (t118 * t332 + t117 * t331 - (-t276 * t333 + t278 * t334 + t273) * t326 + t175) * t325;
t29 = t492 / 0.2e1;
t28 = (t453 - t315 * t276 - t316 * t278 + (t142 - t444) * t332) * t326 + (t109 * t331 + t163 + (t110 - t352) * t332) * t325;
t27 = (t454 - t313 * t276 - t314 * t278 + (t139 - t444) * t331) * t326 + (t108 * t332 + t162 + (t107 - t352) * t331) * t325;
t22 = t493 / 0.2e1;
t12 = m(6) * t75 + t481;
t9 = m(6) * (t161 * t170 + t173 * t186 + t174 * t187) + t400;
t8 = t9 * qJD(5);
t6 = t481 + t510;
t5 = m(6) * t41 + t382;
t4 = t29 - t493 / 0.2e1 + t359;
t3 = t22 - t492 / 0.2e1 + t359;
t2 = t497 + t494 + (-t31 / 0.2e1 + t78 * t487 + t79 * t485) * t326 + (t83 / 0.2e1 + t27 * t487 + t28 * t485) * t325 + t382;
t1 = t29 - t495 / 0.2e1 + t347 + t22;
t10 = [0, 0, t43 * qJD(4) + t106 * qJD(5) + (-m(4) * t224 / 0.2e1 + t164 * t499 + t131 * t498) * t502, t43 * qJD(3) + (t153 * t498 + t176 * t499) * t501 + t167, t106 * qJD(3) + t170 * t480 + t167; 0, 0, ((-t226 * t332 + t228 * t331) * t499 + (-t183 * t332 + t185 * t331) * t498) * t502 + t32 * qJD(4) + qJD(5) * t398, t32 * qJD(3) + ((t188 * t331 - t189 * t332) * t499 + (t165 * t331 - t166 * t332) * t498) * t501 + t145, t148 * t480 + t145 + t89; -qJD(4) * t42 - qJD(5) * t105, t33 * qJD(4) - t94 * t479 / 0.2e1, t6 * qJD(4) + t12 * qJD(5) + (m(6) * (t121 * t131 + t182 * t183 + t184 * t185) + m(5) * (t157 * t164 + t225 * t226 + t227 * t228) + m(4) * (-t224 + t317) * t511 * (rSges(4,1) * t326 - rSges(4,2) * t325) + (t51 + t64 - t504 * t300 + (t331 * t299 - t507) * t332) * t487 + (t50 + t63 - t503 * t299 + (t332 * t300 - t507) * t331) * t486) * qJD(3), t6 * qJD(3) + t1 * qJD(5) + (-t497 / 0.4e1 - t494 / 0.4e1) * t500 + ((t121 * t153 + t124 * t158 + t135 * t242 + t136 * t241 + t165 * t184 + t166 * t182) * t498 + (t157 * t176 + t168 * t181 + t188 * t227 + t189 * t225 + (-t179 * t332 - t180 * t331) * t312) * t499) * t501 + (-t83 / 0.2e1 + (-t28 / 0.2e1 + t74 / 0.2e1) * t332 + (-t27 / 0.2e1 + t73 / 0.2e1) * t331) * t402 - t370 + (t45 * t486 + t46 * t487 + t347 + (t31 / 0.2e1 + (-t79 / 0.2e1 + t122 / 0.2e1) * t332 + (-t78 / 0.2e1 - t123 / 0.2e1) * t331) * t326) * qJD(4), -t401 + t12 * qJD(3) + t1 * qJD(4) + t347 * qJD(5) + (-t428 / 0.2e1 + (t161 * t172 + (-t173 * t332 - t174 * t331) * t294 - t41 + t397) * qJD(5)) * m(6); t42 * qJD(3), -t33 * qJD(3), t2 * qJD(4) + t3 * qJD(5) + ((t121 * t85 + t124 * t131 + t135 * t185 + t136 * t183 + t182 * t96 + t184 * t95) * t498 + (t134 * t157 + t154 * t227 + t155 * t225 + t164 * t168 + t179 * t228 + t180 * t226) * t499) * t502 + t370 + (t350 + t63 * t393 + (-t139 * t332 + t140 * t331) * t391 + (-t141 * t332 + t142 * t331) * t390 + t64 * t392 + t28 * t487 + (-t117 * t332 + t118 * t331) * t488 + (-t151 * t332 + t152 * t331) * t489 + t27 * t486 - t510) * qJD(3), t2 * qJD(3) + (-t505 * t442 / 0.2e1 + t400) * qJD(4) + t512 + (m(6) * (t124 * t153 + t135 * t165 + t136 * t166) / 0.4e1 + m(5) * (t168 * t176 + t179 * t188 + t180 * t189) / 0.4e1) * t500 + ((t123 * t332 + t122 * t331 - (-t409 * t333 + t410 * t334) * t326) * t488 + t45 * t487 + t46 * t485) * t402, t3 * qJD(3) + t7 * qJD(4) + t512; t105 * qJD(3), t89, t401 + t350 * qJD(3) + t4 * qJD(4) + t5 * qJD(5) + (t428 / 0.2e1 + (t132 * t121 + t161 * t131 + t146 * t184 + t147 * t182 + t173 * t185 + t174 * t183 - t75) * qJD(3)) * m(6), t4 * qJD(3) + ((t153 * t161 + t165 * t173 + t166 * t174) * m(6) + t400) * qJD(4) + t8, qJD(3) * t5 + qJD(4) * t9 + t8;];
Cq = t10;
