% Calculate minimal parameter regressor of Coriolis joint torque vector for
% S6PRRRRR4
% Use Code from Maple symbolic Code Generation
% 
% Input:
% qJ [6x1]
%   Generalized joint coordinates (joint angles)
% qJD [6x1]
%   Generalized joint velocities
% pkin [13x1]
%   kinematic parameters (e.g. lengths of the links)
%   pkin=[a2,a3,a4,a5,a6,alpha2,alpha3,d2,d3,d4,d5,d6,theta1]';
% MDP [32x1]
%   Minimal dynamic parameter vector (fixed base model)
%   see S6PRRRRR4_convert_par2_MPV_fixb.m
% 
% Output:
% tauc [6x1]
%   joint torques required to compensate Coriolis and centrifugal load

% Quelle: HybrDyn-Toolbox
% Datum: 2019-03-09 01:02
% Revision: 8e0af74c1e634ead9bab9e082796ada77f031ee9 (2019-03-08)
% Moritz Schappler, moritz.schappler@imes.uni-hannover.de
% (C) Institut für Mechatronische Systeme, Universität Hannover

function tauc = S6PRRRRR4_coriolisvecJ_fixb_mdp_slag_vp(qJ, qJD, pkin, MDP)
%% Coder Information
%#codegen
%$cgargs {zeros(6,1),zeros(6,1),zeros(13,1),zeros(32,1)}
assert(isreal(qJ) && all(size(qJ) == [6 1]), ...
  'S6PRRRRR4_coriolisvecJ_fixb_mdp_slag_vp: qJ has to be [6x1] (double)');
assert(isreal(qJD) && all(size(qJD) == [6 1]), ...
  'S6PRRRRR4_coriolisvecJ_fixb_mdp_slag_vp: qJD has to be [6x1] (double)');
assert(isreal(pkin) && all(size(pkin) == [13 1]), ...
  'S6PRRRRR4_coriolisvecJ_fixb_mdp_slag_vp: pkin has to be [13x1] (double)');
assert(isreal(MDP) && all(size(MDP) == [32 1]), ...
  'S6PRRRRR4_coriolisvecJ_fixb_mdp_slag_vp: MDP has to be [32x1] (double)'); 

%% Symbolic Calculation
% From coriolisvec_joint_fixb_mdp_matlab.m
% OptimizationMode: 2
% StartTime: 2019-03-09 01:00:22
% EndTime: 2019-03-09 01:00:43
% DurationCPUTime: 13.13s
% Computational Cost: add. (8965->564), mult. (23550->809), div. (0->0), fcn. (19747->14), ass. (0->244)
t604 = sin(pkin(7));
t611 = sin(qJ(3));
t739 = t604 * t611;
t595 = pkin(9) * t739;
t606 = cos(pkin(7));
t616 = cos(qJ(3));
t617 = cos(qJ(2));
t732 = t616 * t617;
t612 = sin(qJ(2));
t736 = t611 * t612;
t633 = -t606 * t736 + t732;
t605 = sin(pkin(6));
t716 = qJD(1) * t605;
t737 = t606 * t616;
t786 = t633 * t716 - (pkin(2) * t737 - t595) * qJD(3);
t653 = pkin(3) * t611 - pkin(10) * t616;
t632 = t653 * qJD(3);
t691 = t612 * t716;
t785 = (t632 - t691) * t604;
t711 = qJD(2) * t616;
t688 = t604 * t711;
t588 = -qJD(4) + t688;
t781 = qJD(5) - t588;
t613 = cos(qJ(6));
t702 = qJD(6) * t613;
t712 = qJD(2) * t606;
t594 = qJD(3) + t712;
t615 = cos(qJ(4));
t610 = sin(qJ(4));
t714 = qJD(2) * t604;
t689 = t611 * t714;
t660 = t610 * t689;
t542 = t594 * t615 - t660;
t543 = t594 * t610 + t615 * t689;
t609 = sin(qJ(5));
t614 = cos(qJ(5));
t494 = -t614 * t542 + t543 * t609;
t774 = t494 * t613;
t784 = t702 + t774;
t738 = t604 * t616;
t550 = pkin(9) * t738 + (pkin(2) * t611 + pkin(10)) * t606;
t654 = -pkin(3) * t616 - pkin(10) * t611;
t551 = (-pkin(2) + t654) * t604;
t763 = t615 * t550 + t610 * t551;
t783 = qJD(4) * t763 - t786 * t610 - t785 * t615;
t706 = qJD(4) * t615;
t707 = qJD(4) * t610;
t782 = -t550 * t707 + t551 * t706 + t785 * t610 - t786 * t615;
t563 = -t615 * t606 + t610 * t739;
t708 = qJD(3) * t616;
t686 = t604 * t708;
t526 = -qJD(4) * t563 + t615 * t686;
t710 = qJD(3) * t611;
t687 = t604 * t710;
t780 = pkin(4) * t687 - pkin(11) * t526 - t783;
t564 = t606 * t610 + t615 * t739;
t684 = t610 * t708;
t527 = qJD(4) * t564 + t604 * t684;
t779 = -pkin(11) * t527 + t782;
t568 = pkin(9) * t714 + t691;
t560 = t611 * t568;
t607 = cos(pkin(6));
t715 = qJD(1) * t607;
t692 = t604 * t715;
t752 = qJD(2) * pkin(2);
t579 = t617 * t716 + t752;
t742 = t579 * t606;
t500 = t616 * (t692 + t742) - t560;
t555 = t653 * t714;
t676 = -t500 * t610 + t615 * t555;
t753 = pkin(10) + pkin(11);
t693 = qJD(4) * t753;
t733 = t615 * t616;
t778 = (pkin(4) * t611 - pkin(11) * t733) * t714 + t676 + t615 * t693;
t662 = t610 * t688;
t724 = t615 * t500 + t610 * t555;
t777 = pkin(11) * t662 - t610 * t693 - t724;
t640 = t542 * t609 + t614 * t543;
t698 = qJD(2) * qJD(3);
t681 = t604 * t698;
t658 = t616 * t681;
t515 = -qJD(4) * t660 + t594 * t706 + t615 * t658;
t516 = (t611 * t706 + t684) * t714 + t594 * t707;
t704 = qJD(5) * t614;
t705 = qJD(5) * t609;
t440 = t614 * t515 - t609 * t516 + t542 * t704 - t543 * t705;
t608 = sin(qJ(6));
t659 = t611 * t681;
t694 = t613 * t440 + t608 * t659 + t702 * t781;
t703 = qJD(6) * t608;
t423 = -t640 * t703 + t694;
t421 = t423 * t608;
t477 = t608 * t781 + t613 * t640;
t677 = t440 * t608 - t613 * t659;
t424 = qJD(6) * t477 + t677;
t441 = qJD(5) * t640 + t515 * t609 + t614 * t516;
t436 = t613 * t441;
t746 = t640 * t608;
t475 = -t613 * t781 + t746;
t699 = -qJD(6) - t494;
t434 = t608 * t441;
t728 = -t699 * t702 + t434;
t773 = t699 * t608;
t776 = MDP(23) * t659 - t441 * MDP(22) - t494 ^ 2 * MDP(20) + (t494 * t781 + t440) * MDP(21) + (t494 * MDP(19) + MDP(20) * t640 + MDP(22) * t781 + MDP(30) * t699) * t640 + (t784 * t477 + t421) * MDP(26) + (-t477 * t640 - t699 * t774 + t728) * MDP(28) + (t475 * t640 - t699 * t773 + t436) * MDP(29) + (t423 * t613 - t608 * t424 - t784 * t475 + t477 * t773) * MDP(27);
t582 = t611 * t692;
t501 = t616 * t568 + t611 * t742 + t582;
t487 = pkin(10) * t594 + t501;
t593 = t606 * t715;
t506 = t593 + (qJD(2) * t654 - t579) * t604;
t457 = -t487 * t610 + t615 * t506;
t445 = -pkin(11) * t543 + t457;
t433 = -pkin(4) * t588 + t445;
t458 = t487 * t615 + t506 * t610;
t446 = pkin(11) * t542 + t458;
t750 = t446 * t609;
t412 = t433 * t614 - t750;
t408 = -pkin(5) * t781 - t412;
t775 = t408 * t494;
t569 = t609 * t610 - t614 * t615;
t772 = t781 * t569;
t570 = t609 * t615 + t610 * t614;
t721 = t781 * t570;
t734 = t612 * t616;
t735 = t611 * t617;
t635 = t606 * t734 + t735;
t685 = t606 * t710;
t719 = pkin(2) * t685 + pkin(9) * t686 - t635 * t716;
t456 = pkin(5) * t640 + pkin(12) * t494;
t486 = -pkin(3) * t594 - t500;
t466 = -pkin(4) * t542 + t486;
t623 = t633 * qJD(2);
t661 = t607 * t686;
t467 = (t579 * t737 - t560) * qJD(3) + (t605 * t623 + t661) * qJD(1);
t520 = (t632 + t691) * t714;
t621 = -qJD(4) * t458 - t610 * t467 + t615 * t520;
t414 = pkin(4) * t659 - pkin(11) * t515 + t621;
t630 = t615 * t467 - t487 * t707 + t506 * t706 + t610 * t520;
t419 = -pkin(11) * t516 + t630;
t665 = -t609 * t414 - t614 * t419 - t433 * t704 + t446 * t705;
t771 = t466 * t494 + t665;
t672 = -t550 * t610 + t615 * t551;
t473 = -pkin(4) * t738 - pkin(11) * t564 + t672;
t479 = -pkin(11) * t563 + t763;
t726 = t609 * t473 + t614 * t479;
t767 = qJD(5) * t726 + t779 * t609 - t780 * t614;
t766 = t473 * t704 - t479 * t705 + t780 * t609 + t779 * t614;
t589 = t753 * t610;
t590 = t753 * t615;
t638 = -t589 * t614 - t590 * t609;
t765 = qJD(5) * t638 - t778 * t609 + t777 * t614;
t532 = -t589 * t609 + t590 * t614;
t764 = qJD(5) * t532 + t777 * t609 + t778 * t614;
t657 = -t501 + (-t662 + t707) * pkin(4);
t723 = pkin(4) * t527 + t719;
t749 = t446 * t614;
t413 = t433 * t609 + t749;
t622 = -qJD(5) * t413 + t614 * t414 - t609 * t419;
t397 = -pkin(5) * t659 - t622;
t409 = pkin(12) * t781 + t413;
t427 = pkin(5) * t494 - pkin(12) * t640 + t466;
t646 = t409 * t608 - t427 * t613;
t761 = -t397 * t613 + t408 * t703 + t640 * t646;
t395 = t397 * t608;
t399 = t409 * t613 + t427 * t608;
t760 = t399 * t640 + t408 * t702 + t395;
t758 = -t466 * t640 + t622;
t601 = t604 ^ 2;
t756 = (-MDP(5) * t611 * t616 + (t611 ^ 2 - t616 ^ 2) * MDP(6)) * t601;
t745 = t542 * t588;
t744 = t543 * t588;
t743 = t570 * t613;
t741 = t588 * t610;
t740 = t588 * t615;
t730 = -pkin(5) * t687 + t767;
t725 = pkin(5) * t689 + t764;
t713 = qJD(2) * t605;
t709 = qJD(3) * t615;
t700 = qJD(3) - t594;
t696 = t608 * t738;
t600 = -pkin(4) * t615 - pkin(3);
t690 = t601 * t711;
t682 = qJD(1) * t713;
t396 = pkin(12) * t659 - t665;
t637 = t606 * t612 * t682;
t468 = qJD(3) * t582 + t568 * t708 + t579 * t685 + t616 * t637 + t682 * t735;
t452 = pkin(4) * t516 + t468;
t405 = pkin(5) * t441 - pkin(12) * t440 + t452;
t680 = -t396 * t608 + t613 * t405;
t675 = t608 * t772 - t613 * t689;
t674 = t608 * t689 + t613 * t772;
t598 = pkin(4) * t609 + pkin(12);
t667 = pkin(4) * t543 + qJD(6) * t598 + t456;
t663 = t604 * t612 * t713;
t417 = t445 * t609 + t749;
t656 = pkin(4) * t705 - t417;
t418 = t445 * t614 - t750;
t655 = -pkin(4) * t704 + t418;
t512 = t614 * t563 + t564 * t609;
t513 = -t563 * t609 + t564 * t614;
t549 = t595 + (-pkin(2) * t616 - pkin(3)) * t606;
t514 = pkin(4) * t563 + t549;
t449 = pkin(5) * t512 - pkin(12) * t513 + t514;
t652 = -pkin(12) * t687 - qJD(6) * t449 - t766;
t431 = -pkin(12) * t738 + t726;
t454 = -qJD(5) * t512 + t526 * t614 - t527 * t609;
t455 = qJD(5) * t513 + t526 * t609 + t614 * t527;
t651 = -pkin(5) * t455 + pkin(12) * t454 + qJD(6) * t431 - t723;
t519 = pkin(5) * t569 - pkin(12) * t570 + t600;
t650 = pkin(12) * t689 - qJD(6) * t519 - t765;
t649 = -pkin(5) * t721 - pkin(12) * t772 + qJD(6) * t532 - t657;
t648 = t396 * t613 + t405 * t608;
t647 = -t441 * t598 + t775;
t634 = t606 * t735 + t734;
t523 = t605 * t634 + t607 * t739;
t562 = -t604 * t605 * t617 + t606 * t607;
t488 = -t523 * t610 + t562 * t615;
t489 = t523 * t615 + t562 * t610;
t451 = t488 * t609 + t489 * t614;
t636 = t606 * t732 - t736;
t522 = -t605 * t636 - t607 * t738;
t645 = t451 * t613 + t522 * t608;
t644 = -t451 * t608 + t522 * t613;
t642 = t473 * t614 - t479 * t609;
t641 = t488 * t614 - t489 * t609;
t490 = t513 * t608 + t613 * t738;
t627 = t570 * t702 - t675;
t626 = -t570 * t703 - t674;
t538 = -t579 * t604 + t593;
t624 = qJD(3) * (t538 * t604 - t601 * t752);
t618 = qJD(2) ^ 2;
t599 = -pkin(4) * t614 - pkin(5);
t491 = t513 * t613 - t696;
t483 = t661 + (qJD(3) * t636 + t623) * t605;
t482 = t607 * t687 + (qJD(2) * t635 + qJD(3) * t634) * t605;
t439 = qJD(4) * t488 + t483 * t615 + t610 * t663;
t438 = -qJD(4) * t489 - t483 * t610 + t615 * t663;
t430 = pkin(5) * t738 - t642;
t429 = -qJD(6) * t696 + t454 * t608 + t513 * t702 - t613 * t687;
t428 = -qJD(6) * t490 + t454 * t613 + t608 * t687;
t403 = qJD(5) * t451 - t438 * t614 + t439 * t609;
t402 = qJD(5) * t641 + t438 * t609 + t439 * t614;
t394 = -qJD(6) * t399 + t680;
t393 = -qJD(6) * t646 + t648;
t1 = [(-t482 * t594 + t562 * t659) * MDP(10) + (-t483 * t594 + t562 * t658) * MDP(11) + (-t438 * t588 - t482 * t542 + t488 * t659 + t516 * t522) * MDP(17) + (t439 * t588 + t482 * t543 - t489 * t659 + t515 * t522) * MDP(18) + (-t403 * t781 + t441 * t522 + t482 * t494 + t641 * t659) * MDP(24) + (-t402 * t781 + t440 * t522 - t451 * t659 + t482 * t640) * MDP(25) + (-(-qJD(6) * t645 - t402 * t608 + t482 * t613) * t699 + t644 * t441 + t403 * t475 - t641 * t424) * MDP(31) + ((qJD(6) * t644 + t402 * t613 + t482 * t608) * t699 - t645 * t441 + t403 * t477 - t641 * t423) * MDP(32) + (-MDP(4) * t617 + (-MDP(3) + (-MDP(10) * t616 + MDP(11) * t611) * t601) * t612) * t618 * t605; (-t440 * t512 - t441 * t513 - t454 * t494 - t455 * t640) * MDP(20) + (t440 * t513 + t454 * t640) * MDP(19) + (MDP(7) * t686 - MDP(8) * t687) * (t594 + t712) + (t454 * t781 + (-t440 * t616 + (qJD(2) * t513 + t640) * t710) * t604) * MDP(21) + (t514 * t440 + t452 * t513 + t466 * t454 - t766 * t781 + t723 * t640 + (-t665 * t616 + (-qJD(2) * t726 - t413) * t710) * t604) * MDP(25) + (t514 * t441 + t452 * t512 + t466 * t455 - t767 * t781 + t723 * t494 + (-t622 * t616 + (qJD(2) * t642 + t412) * t710) * t604) * MDP(24) + (-t455 * t781 + (t441 * t616 + (-qJD(2) * t512 - t494) * t710) * t604) * MDP(22) + (-(t431 * t613 + t449 * t608) * t441 - t393 * t512 - t399 * t455 + t430 * t423 + t397 * t491 + t408 * t428 - (t608 * t651 + t613 * t652) * t699 + t730 * t477) * MDP(32) + (-t424 * t512 + t429 * t699 - t441 * t490 - t455 * t475) * MDP(29) + (t423 * t512 - t428 * t699 + t441 * t491 + t455 * t477) * MDP(28) + (t441 * t512 - t455 * t699) * MDP(30) + ((-t431 * t608 + t449 * t613) * t441 + t394 * t512 - t646 * t455 + t430 * t424 + t397 * t490 + t408 * t429 - (t608 * t652 - t613 * t651) * t699 + t730 * t475) * MDP(31) - 0.2e1 * t756 * t698 + (t604 * t781 - t690) * MDP(23) * t710 + (-t467 * t606 + t786 * t594 + t616 * t624) * MDP(11) + (t468 * t564 + t486 * t526 + t549 * t515 + t782 * t588 + t719 * t543 + (t630 * t616 + (-qJD(2) * t763 - t458) * t710) * t604) * MDP(18) + (t468 * t563 + t486 * t527 + t549 * t516 + t783 * t588 - t719 * t542 + (-t621 * t616 + (t672 * qJD(2) + t457) * t710) * t604) * MDP(17) + (-t515 * t563 - t516 * t564 + t526 * t542 - t527 * t543) * MDP(13) + (t515 * t564 + t526 * t543) * MDP(12) + (-t423 * t490 - t424 * t491 - t428 * t475 - t429 * t477) * MDP(27) + (t423 * t491 + t428 * t477) * MDP(26) + (-t588 * t604 - t690) * MDP(16) * t710 + (-t468 * t606 - t594 * t719 + t611 * t624) * MDP(10) + (-t526 * t588 + (-t515 * t616 + (qJD(2) * t564 + t543) * t710) * t604) * MDP(14) + (t527 * t588 + (t516 * t616 + (-qJD(2) * t563 + t542) * t710) * t604) * MDP(15); t700 * MDP(7) * t688 + (-t424 * t569 - t434 * t570 - t475 * t721 + t627 * t699) * MDP(29) + (t515 * t610 - t543 * t740) * MDP(12) + (-pkin(3) * t516 - t468 * t615 + t676 * t588 + t501 * t542 + (pkin(10) * t740 + t486 * t610) * qJD(4) + (-t457 * t611 + (-pkin(10) * t710 - t486 * t616) * t610) * t714) * MDP(17) + (t588 * t707 + (-t616 * t741 + (-t542 + t709) * t611) * t714) * MDP(15) + (-pkin(3) * t515 + t468 * t610 - t501 * t543 - t724 * t588 + (-pkin(10) * t741 + t486 * t615) * qJD(4) + (-t486 * t733 + (-pkin(10) * t709 + t458) * t611) * t714) * MDP(18) + (t500 * t594 + (qJD(3) * t568 + t637) * t611 + (-t538 * t714 - qJD(3) * t742 + (-qJD(3) * t604 * t607 - t617 * t713) * qJD(1)) * t616) * MDP(11) + (t423 * t743 + t477 * t626) * MDP(26) + (-(t519 * t608 + t532 * t613) * t441 - t393 * t569 - t638 * t423 + t397 * t743 - (t608 * t649 + t613 * t650) * t699 + t725 * t477 - t721 * t399 + t626 * t408) * MDP(32) + ((t515 - t745) * t615 + (-t516 + t744) * t610) * MDP(13) + (t423 * t569 + t436 * t570 + t477 * t721 - t626 * t699) * MDP(28) + (t675 * t477 + t674 * t475 + (-t421 - t424 * t613 + (t475 * t608 - t477 * t613) * qJD(6)) * t570) * MDP(27) + ((t519 * t613 - t532 * t608) * t441 + t394 * t569 - t638 * t424 + t570 * t395 - (t608 * t650 - t613 * t649) * t699 + t725 * t475 - t721 * t646 + t627 * t408) * MDP(31) + (t600 * t440 + t452 * t570 - t466 * t772 + t640 * t657) * MDP(25) + (-t588 * t706 + (t588 * t733 + (qJD(3) * t610 - t543) * t611) * t714) * MDP(14) + (t441 * t569 - t699 * t721) * MDP(30) + (t600 * t441 + t452 * t569 + t721 * t466 + t657 * t494) * MDP(24) + (t440 * t570 - t640 * t772) * MDP(19) + (-t440 * t569 - t441 * t570 + t494 * t772 - t640 * t721) * MDP(20) + (t501 * t594 - t468) * MDP(10) + t756 * t618 - (MDP(21) * t772 + t721 * MDP(22) + MDP(24) * t764 + MDP(25) * t765) * t781 + (-t700 * MDP(8) + t588 * MDP(16) - t781 * MDP(23) + (-qJD(3) * t532 + t413) * MDP(25) + (-qJD(3) * t569 + t494) * MDP(22) + (qJD(3) * t638 - t412) * MDP(24) + (qJD(3) * t570 - t640) * MDP(21) - t538 * MDP(10)) * t689; (t599 * t424 + t647 * t608 + t656 * t475 - (t608 * t655 - t613 * t667) * t699 + t761) * MDP(31) + (t599 * t423 + t647 * t613 + t656 * t477 - (t608 * t667 + t613 * t655) * t699 + t760) * MDP(32) + (t418 * t781 + (-t543 * t640 - t609 * t659 - t704 * t781) * pkin(4) + t771) * MDP(25) + (t417 * t781 + (-t494 * t543 + t614 * t659 - t705 * t781) * pkin(4) + t758) * MDP(24) + (-t516 - t744) * MDP(15) + (t515 + t745) * MDP(14) + (-t458 * t588 - t486 * t543 + t621) * MDP(17) + (-t457 * t588 - t486 * t542 - t630) * MDP(18) + MDP(16) * t659 + (-t542 ^ 2 + t543 ^ 2) * MDP(13) - t543 * t542 * MDP(12) + t776; (t413 * t781 + t758) * MDP(24) + (t412 * t781 + t771) * MDP(25) + (-pkin(5) * t424 + (-t412 * t608 + t456 * t613) * t699 - t413 * t475 + t608 * t775 - t728 * pkin(12) + t761) * MDP(31) + (-pkin(5) * t423 - (t412 * t613 + t456 * t608) * t699 - t413 * t477 + t408 * t774 + (-t699 * t703 - t436) * pkin(12) + t760) * MDP(32) + t776; t477 * t475 * MDP(26) + (-t475 ^ 2 + t477 ^ 2) * MDP(27) + (-t475 * t699 + t694) * MDP(28) + (-t477 * t699 - t677) * MDP(29) + t441 * MDP(30) + (-t399 * t699 - t408 * t477 + t680) * MDP(31) + (t408 * t475 + t646 * t699 - t648) * MDP(32) + (-MDP(28) * t746 - MDP(29) * t477 - MDP(31) * t399 + MDP(32) * t646) * qJD(6);];
tauc  = t1;
